<?php

// 地域名とそれぞれのキー番号の連想配列
$area = array("1"=>"全国", "2"=>"北海道・東北", "3"=>"関東", "4"=>"中部", "5"=>"近畿", "6"=>"中国", "7"=>"四国", "8"=>"九州・沖縄");

// それぞれの地域のキーに対応する都道府県番号の連想配列
$respArea = array(
    "1" => array("1", "2", "3", "4", "5", "6","7", "8", "9", "10", "11", "12", "13", "14", "15", "16", "17", "18", "19", "20", "21", "22", "23", "24", "25", "26", "27", "28", "29", "30", "31", "32", "33", "34", "35", "36", "37", "38", "39", "40", "41", "42", "43", "44", "45", "46", "47"),
    "2" => array("1", "2", "3", "4", "5", "6", "7"), 
    "3" => array("8", "9", "10", "11", "12", "13", "14"), 
    "4" => array("15", "16", "17", "18", "19", "20", "21", "22", "23"),
    "5" => array("24", "25", "26", "27", "28", "29", "30"), 
    "6" => array("31", "32", "33", "34", "35"), 
    "7" => array("36", "37", "38", "39"), 
    "8" => array("40", "41", "42", "43", "44", "45", "46", "47")
);

// 都道府県の表示時の名前と都道府県番号の連想配列
$prefList = array(
    "1"=>"北海道", "2"=>"青森県", "3"=>"岩手県", "4"=>"宮城県", "5"=>"秋田県",
    "6"=>"山形県", "7"=>"福島県", "8"=>"茨城県", "9"=>"栃木県", "10"=>"群馬県",
    "11"=>"埼玉県", "12"=>"千葉県", "13"=>"東京都", "14"=>"神奈川県", "15"=>"新潟県",
    "16"=>"富山県", "17"=>"石川県", "18"=>"福井県", "19"=>"山梨県", "20"=>"長野県",
    "21"=>"岐阜県", "22"=>"静岡県", "23"=>"愛知県", "24"=>"三重県", "25"=>"滋賀県",
    "26"=>"京都府", "27"=>"大阪府", "28"=>"兵庫県", "29"=>"奈良県", "30"=>"和歌山県",
    "31"=>"鳥取県", "32"=>"島根県", "33"=>"岡山県", "34"=>"広島県", "35"=>"山口県",
    "36"=>"徳島県", "37"=>"香川県", "38"=>"愛媛県", "39"=>"高知県", "40"=>"福岡県",
    "41"=>"佐賀県", "42"=>"長崎県", "43"=>"熊本県", "44"=>"大分県", "45"=>"宮崎県",
    "46"=>"鹿児島県", "47"=>"沖縄県" 
);

// 都道府県の検索時の読みと都道府県番号の連想配列
$readList = array(
    "1"=>"hokkaido", "2"=>"aomori", "3"=>"iwate", "4"=>"miyagi", "5"=>"akita",
    "6"=>"yamagata", "7"=>"fukushima", "8"=>"ibaraki", "9"=>"tochigi", "10"=>"gunma",
    "11"=>"saitama", "12"=>"chiba", "13"=>"tokyo", "14"=>"kanagawa", "15"=>"nigata", 
    "16"=>"toyama", "17"=>"ishikawa", "18"=>"fukui", "19"=>"yamanashi", "20"=>"nagano",
    "21"=>"gifu", "22"=>"shizuoka", "23"=>"aichi", "24"=>"mie", "25"=>"shiga",
    "26"=>"kyoto", "27"=>"osaka", "28"=>"hyogo", "29"=>"nara", "30"=>"wakayama", 
    "31"=>"tottori", "32"=>"shimane", "33"=>"okayama", "34"=>"hiroshima", "35"=>"yamaguchi", 
    "36"=>"tokushima", "37"=>"kagawa", "38"=>"ehime", "39"=>"kouchi", "40"=>"fukuoka",
    "41"=>"saga", "42"=>"nagasaki", "43"=>"kumamoto", "44"=>"oita", "45"=>"mmiyazaki", 
    "46"=>"kagoshima", "47"=>"okinawa"
);


// 検索して表示する自作関数
function searchResult($respArea,$readList,$prefList){
    if(isset($_POST['area'])){
        // 飛んできた飛んできた地域番号で対応する都道府県番号を回す
        foreach($respArea[$_POST['area']] as $a){
            // 飛んできた文字と読みの配列を正規表現でチェック
            if(preg_match("/^".strtolower($_POST['str'])."/", $readList[$a])){
                // 一致したものの都道府県番号で表示用配列から表示
                echo $prefList[$a]."<br>";
            }
        }
    }
}

// 地域のセレクトボックスを作成する自作関数
function makeSelect($array){
    echo "<select name='area'>";
    foreach($array as $key => $value){
        echo "<option value=".'"'.$key.'"';
        // 選択されたものを更新後のページで表示させる
        if(isset($_POST['area']) && $_POST['area'] == $key){
            echo 'selected';
        }
        echo ">".$value."</option>";
    }
    echo "</select>";
}


?>