<?php
    // 都道府県とそれぞれの頭文字のアルファベットの配列
    $prefectures = array(
        "北海道"=>"h", "青森県"=>"a", "岩手県"=>"i", "宮城県"=>"m", "秋田県"=>"a",
        "山形県"=>"y", "福島県"=>"f", "茨城県"=>"i", "栃木県"=>"t", "群馬県"=>"g",
        "埼玉県"=>"s", "千葉県"=>"c", "東京都"=>"t", "神奈川県"=>"k", "新潟県"=>"n",
        "富山県"=>"t", "石川県"=>"i", "福井県"=>"f", "山梨県"=>"y", "長野県"=>"n",
        "岐阜県"=>"g", "静岡県"=>"s", "愛知県"=>"a", "三重県"=>"m", "滋賀県"=>"s",
        "京都府"=>"k", "大阪府"=>"o", "兵庫県"=>"h", "奈良県"=>"n", "和歌山県"=>"w",
        "鳥取県"=>"t", "島根県"=>"s", "岡山県"=>"o", "広島県"=>"h", "山口県"=>"y",
        "徳島県"=>"t", "香川県"=>"k", "愛媛県"=>"e", "高知県"=>"k", "福岡県"=>"f",
        "佐賀県"=>"s", "長崎県"=>"n", "熊本県"=>"k", "大分県"=>"o", "宮崎県"=>"m",
        "鹿児島県"=>"k", "沖縄県"=>"o" 
    );
    
    function resPlef($array){
        if(count($array) == 0){
            echo "該当なし";
        } else{
            $j = 0;
            foreach((array)$array as $value){
                echo $array[$j]."<br>";
                $j++;
            }
        }
    }
?>